{
  "version": "2.0",
  "metadata": {
    "date": "2026-02-17",
    "activityId": "i125799639",
    "activityName": {
      "en_US": "Tuesday Easy Recovery",
      "pt_BR": "Fácil de Terça - Recuperação"
    },
    "analysisDate": "2026-02-17T20:00:00Z",
    "coach": "Claude-2h50-Marathon"
  },
  "session": {
    "type": "easy",
    "distance": 20017,
    "duration": 5934,
    "avgPace": "4:58/km",
    "avgPower": 272,
    "avgHR": 148,
    "trainingLoad": 95
  },
  "marathonContext": {
    "goalPace": "4:02/km",
    "goalTime": "2:50:00",
    "weeksToRace": 15,
    "currentPhase": {
      "en_US": "Base Building - Week 1",
      "pt_BR": "Construção de Base - Semana 1"
    }
  },
  "analysis": {
    "strengths": {
      "en_US": [
        "Excellent aerobic efficiency with only 2.01% decoupling over 20km, demonstrating strong cardiovascular adaptation",
        "Maintained controlled heart rate at 148 bpm (83% LTHR), staying solidly in Zone 2 throughout the session",
        "Pace of 4:58/km is appropriately easy and builds aerobic base effectively",
        "Good cadence average of 87 spm indicates efficient running mechanics even at easy pace",
        "Power-HR coupling of 1.84 shows excellent aerobic efficiency at recovery intensity"
      ],
      "pt_BR": [
        "Excelente eficiência aeróbica com apenas 2,01% de descoplamento em 20km, demonstrando forte adaptação cardiovascular",
        "Manteve frequência cardíaca controlada em 148 bpm (83% LTHR), permanecendo solidamente na Zona 2 durante toda a sessão",
        "Ritmo de 4:58/km é apropriadamente fácil e constrói base aeróbica efetivamente",
        "Boa média de cadência de 87 ppm indica mecânica de corrida eficiente mesmo em ritmo fácil",
        "Acoplamento Potência-FC de 1,84 mostra excelente eficiência aeróbica em intensidade de recuperação"
      ]
    },
    "concerns": {
      "en_US": [
        "Training load of 95 TSS is excessive for a recovery day following double day - should be 40-50 TSS maximum",
        "The 20km distance undermines recovery goals - recommended maximum was 8-10km after yesterday's double",
        "Despite easy pace, the high volume prevents actual recovery from Monday's 94 TSS combined load",
        "Current TSB of -15 indicates accumulated fatigue requiring careful load management this week"
      ],
      "pt_BR": [
        "Carga de treino de 95 TSS é excessiva para um dia de recuperação seguindo dia duplo - deveria ser máximo 40-50 TSS",
        "A distância de 20km prejudica objetivos de recuperação - máximo recomendado era 8-10km após o dia duplo de ontem",
        "Apesar do ritmo fácil, o alto volume previne recuperação real da carga combinada de 94 TSS de segunda",
        "TSB atual de -15 indica fadiga acumulada requerendo gestão cuidadosa de carga esta semana"
      ]
    },
    "keyFindings": {
      "en_US": [
        "This demonstrates a critical training error: confusing 'easy pace' with 'easy training load'",
        "Running 20km at easy pace still accumulates 95 TSS, which is a moderate workout - not recovery",
        "Current TSB at -15 (down from -13.6 yesterday) shows fatigue is accumulating, not dissipating",
        "Quality sessions like Monday's double require SHORT recovery runs (6-8km max) to allow adaptation",
        "The aerobic execution was technically excellent, but volume timing was inappropriate for recovery"
      ],
      "pt_BR": [
        "Isto demonstra um erro crítico de treinamento: confundir 'ritmo fácil' com 'carga de treino fácil'",
        "Correr 20km em ritmo fácil ainda acumula 95 TSS, que é um treino moderado - não recuperação",
        "TSB atual em -15 (caiu de -13.6 ontem) mostra que fadiga está acumulando, não dissipando",
        "Sessões de qualidade como o dia duplo de segunda requerem corridas de recuperação CURTAS (máx 6-8km) para permitir adaptação",
        "A execução aeróbica foi tecnicamente excelente, mas o timing do volume foi inapropriado para recuperação"
      ]
    }
  },
  "metrics": {
    "kmAtMarathonPace": 0,
    "kmAtThresholdPace": 0,
    "kmAtEasyPace": 20.02,
    "totalKm": 20.02
  },
  "recommendations": {
    "nextSession": [
      {
        "date": "2026-02-18",
        "timeOfDay": "AM",
        "type": "easy",
        "optional": false,
        "workout": {
          "en_US": "6-8km EASY @ 5:15-5:30/km, HR <140bpm - ADAPTATIONS: Reduce volume significantly. Current TSB -15 requires active recovery, not training stimulus. Focus on movement and blood flow only.",
          "pt_BR": "6-8km FÁCIL @ 5:15-5:30/km, FC <140bpm - ADAPTAÇÕES: Reduza volume significativamente. TSB atual -15 requer recuperação ativa, não estímulo de treino. Foco em movimento e fluxo sanguíneo apenas."
        },
        "rationale": {
          "en_US": "With TSB at -15 after two high-volume days (94 TSS Mon + 95 TSS Tue), the priority is recovery. A short, very easy run promotes blood flow without adding fatigue. If legs feel heavy, take complete rest instead.",
          "pt_BR": "Com TSB em -15 após dois dias de alto volume (94 TSS Seg + 95 TSS Ter), a prioridade é recuperação. Uma corrida curta e muito fácil promove fluxo sanguíneo sem adicionar fadiga. Se pernas estiverem pesadas, faça descanso completo."
        }
      }
    ],
    "weeklyAdjustments": {
      "en_US": [
        "Critical: Limit ALL recovery runs to 10km maximum for remainder of training cycle",
        "Wednesday: Execute 6-8km easy only. Skip any PM session regardless of plan",
        "Thursday: If TSB improves to -10 or better, can proceed with planned quality session at 90% volume",
        "Friday: Another short easy day (6-8km), no PM session",
        "Weekend long run: If planned, reduce by 20-25% to allow recovery buffer",
        "Remember: Recovery runs build fitness through adaptation, not through accumulation of more fatigue"
      ],
      "pt_BR": [
        "Crítico: Limite TODAS corridas de recuperação a máximo 10km pelo resto do ciclo de treino",
        "Quarta: Execute apenas 6-8km fácil. Pule qualquer sessão PM independentemente do plano",
        "Quinta: Se TSB melhorar para -10 ou melhor, pode prosseguir com sessão de qualidade planejada a 90% do volume",
        "Sexta: Outro dia fácil curto (6-8km), sem sessão PM",
        "Longão do fim de semana: Se planejado, reduza em 20-25% para permitir margem de recuperação",
        "Lembre-se: Corridas de recuperação constroem fitness através de adaptação, não através de acúmulo de mais fadiga"
      ]
    },
    "progressionNotes": {
      "en_US": "IMPORTANT CORRECTION NEEDED: You are confusing 'easy pace' with 'easy training'. Running 20km at 4:58/km accumulates 95 TSS - this is NOT recovery, it's a moderate aerobic workout. Recovery days must be SHORT (6-10km max) to allow adaptation from quality sessions. Your aerobic efficiency is excellent (2% decoupling, good power-HR), showing strong base fitness. However, with TSB now at -15 (worse than yesterday's -13.6), you're accumulating fatigue instead of recovering. For Week 1 of a new cycle, this is particularly concerning. Moving forward: cap ALL recovery runs at 10km maximum. This will allow your body to adapt to quality sessions and improve your CTL/ATL ratio naturally.",
      "pt_BR": "CORREÇÃO IMPORTANTE NECESSÁRIA: Você está confundindo 'ritmo fácil' com 'treino fácil'. Correr 20km em 4:58/km acumula 95 TSS - isto NÃO é recuperação, é um treino aeróbico moderado. Dias de recuperação devem ser CURTOS (máx 6-10km) para permitir adaptação das sessões de qualidade. Sua eficiência aeróbica é excelente (2% descoplamento, bom potência-FC), mostrando base forte de condicionamento. Porém, com TSB agora em -15 (pior que -13.6 de ontem), você está acumulando fadiga ao invés de recuperar. Para Semana 1 de um novo ciclo, isto é particularmente preocupante. Daqui pra frente: limite TODAS corridas de recuperação em máximo 10km. Isto permitirá que seu corpo se adapte às sessões de qualidade e melhore sua relação CTL/ATL naturalmente."
    }
  },
  "verdict": {
    "rating": "acceptable",
    "summary": {
      "en_US": "Technically well-executed aerobic session (controlled HR, excellent decoupling, good efficiency), but inappropriately high volume for a recovery day. Current TSB of -15 requires immediate attention to load management.",
      "pt_BR": "Sessão aeróbica tecnicamente bem executada (FC controlada, excelente descoplamento, boa eficiência), mas volume inapropriadamente alto para um dia de recuperação. TSB atual de -15 requer atenção imediata à gestão de carga."
    },
    "goalViability": {
      "2h50": "possible",
      "confidence": "moderate",
      "notes": {
        "en_US": "Your underlying fitness is strong (CTL 68.8, excellent aerobic efficiency, good base from Monday's quality work). The 2h50 goal remains achievable. However, current training execution shows a misunderstanding of recovery principles. TSB at -15 after a recovery day indicates volume is too high. With immediate correction (strict 10km cap on all easy runs), adaptation will improve and goal remains on track. Without correction, you risk overtraining and performance decline.",
        "pt_BR": "Sua aptidão subjacente é forte (CTL 68,8, excelente eficiência aeróbica, boa base do trabalho de qualidade de segunda). O objetivo de 2h50 permanece alcançável. Porém, a execução atual do treino mostra má compreensão de princípios de recuperação. TSB em -15 após um dia de recuperação indica que volume está muito alto. Com correção imediata (limite estrito de 10km em todas corridas fáceis), a adaptação melhorará e objetivo permanece no caminho. Sem correção, você arrisca overtraining e declínio de desempenho."
      }
    }
  }
}
