{
  "version": "1.0",
  "metadata": {
    "date": "2026-02-16",
    "activityId": "i125562353",
    "activityName": "Forte x Fraco",
    "analysisDate": "2026-02-16T12:00:00Z",
    "coach": "Claude-2h50-Marathon"
  },
  "session": {
    "type": "threshold",
    "distance": 11028,
    "duration": 2941,
    "avgPace": "4:26/km",
    "avgPower": 304,
    "avgHR": 155,
    "trainingLoad": 59
  },
  "marathonContext": {
    "goalPace": "4:02/km",
    "goalTime": "2:50:00",
    "weeksToRace": 15,
    "currentPhase": "Base Build (Week 4 of 20)"
  },
  "analysis": {
    "strengths": [
      "Progressive overload execution - each interval showed consistent or improved power output (319-338W across intervals)",
      "Excellent aerobic efficiency with only 2.9% power:HR decoupling over the session",
      "Consistent cadence of 87-90 rpm across all work intervals maintaining good running economy",
      "Power:HR ratio of 1.96 indicates strong mechanical efficiency at threshold intensity",
      "Strong finish with final intervals showing highest power (334-338W) despite accumulated fatigue"
    ],
    "concerns": [
      "Interval pacing inconsistent - most 800m reps executed at 4:07-4:13/km, which is 5-11s slower than marathon goal pace of 4:02/km",
      "Short interval length (800m) doesn't build marathon-specific endurance - need continuous efforts of 2-5km",
      "Incomplete recoveries with HR only dropping to 156-162 bpm during rest periods, limiting workout quality",
      "Session positioned as 'threshold' work but paces ranged from easy (4:13) to true threshold (3:57), lacking specificity"
    ],
    "keyFindings": [
      "Current threshold capability around 4:06/km sustained (based on work interval average) is 4 seconds slower than marathon goal pace",
      "HR response of 155-167 bpm (87-94% LTHR) during work intervals confirms lactate threshold intensity",
      "Power output averaged 304W (85% FTP) suggesting solid aerobic fitness foundation",
      "Total session load of 59 is appropriate for Base Build phase without excessive fatigue accumulation",
      "CTL of 65 with ATL of 75 shows slight overreach - form (TSB) of -10 indicates moderate training stress"
    ]
  },
  "metrics": {
    "kmAtMarathonPace": 3.2,
    "kmAtThresholdPace": 0,
    "kmAtEasyPace": 4.0,
    "totalKm": 11.0
  },
  "recommendations": {
    "nextSession": {
      "date": "2026-02-17",
      "type": "easy",
      "workout": "Easy recovery 10km @ 4:55-5:05/km - ADAPTATIONS: Execute as planned. Today's moderate load (59 TSS) and current form (TSB -10) allow for standard recovery pace. Keep HR <140 bpm and maintain conversational effort. If legs feel heavy in first 2km, slow to 5:10-5:20/km range.",
      "rationale": "Standard recovery protocol after quality threshold work. Current fatigue markers (TSB -10, ATL 75) indicate moderate training stress but nothing concerning. Sleep and HR metrics support normal easy running. Monitor how legs respond in first 10min warmup."
    },
    "weeklyFocus": [
      "Tuesday (Feb 18): AM - Easy 8km @ 4:50-5:00/km, PM - 4km @ 4:00-4:04/km (doubles for MP banking, total 12km)",
      "Wednesday (Feb 19): Speed work - 10 x 400m @ 3:35-3:40/km with 90s jog recovery, total 10-11km",
      "Thursday (Feb 20): AM - Easy 7km @ 4:50-5:00/km, PM - 3km @ 4:00-4:04/km (doubles for MP banking, total 10km)",
      "Saturday (Feb 22): Long run 24km - first 18km @ 4:35-4:45/km, final 6km progressive to 4:10/km finishing at MP",
      "Sunday (Feb 23): Threshold - 2 x 3km @ 4:00-4:02/km with 3min recovery, total 14-15km"
    ],
    "progressionNotes": "You've proven you can execute short intervals with good power output. The next progression is extending interval duration while maintaining intensity. Your current fitness (CTL 65) supports 3km threshold intervals. Focus on pacing discipline - start conservatively at 4:02/km rather than attacking at 4:00/km. Week 4 marks the end of Base Build phase - next week begins Build phase where we increase both volume and intensity of quality work. Implement doubles strategy (AM easy + PM short MP) on Tuesday/Thursday to bank additional marathon pace kilometers (7km/week extra) while maintaining recovery between quality sessions."
  },
  "verdict": {
    "rating": "good",
    "summary": "Solid threshold session demonstrating good progressive execution and aerobic efficiency, though pacing was inconsistent and slower than marathon goal pace. The 2.9% decoupling and strong finish indicate excellent fitness foundation.",
    "goalViability": {
      "2h50": "possible",
      "confidence": "moderate",
      "notes": "Current threshold capability (4:06/km sustained) is close to goal marathon pace (4:02/km). With 15 weeks remaining and strong aerobic base, the gap is closeable through specific marathon pace work and longer threshold efforts. Key will be progressing interval length while improving pace consistency."
    }
  }
}
